# Customer Shared - Staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/shared/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/Connectilly/customer-shared-staging/runs/run-YQoC1rcrkzBfW593

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.database.cockroach_cluster.default: Refreshing state... [id=bfad5b64-2446-46f4-88c1-08ea8a31671a]
module.database.cockroach_database.default: Refreshing state... [id=bfad5b64-2446-46f4-88c1-08ea8a31671a:customer]
module.database.aws_ssm_parameter.default: Refreshing state... [id=customer-shared-staging-customer-cluster-id]
module.database_user.data.aws_ssm_parameter.cluster_id: Refreshing...
module.database_user.data.aws_ssm_parameter.cluster_id: Refresh complete after 0s [id=customer-shared-staging-customer-cluster-id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.database_user.aws_ssm_parameter.password will be created
  + resource "aws_ssm_parameter" "password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "customer-shared-staging-customer-shared-password"
      + tags           = {
          + "domain"        = "customer"
          + "environment"   = "customer-shared-staging"
          + "resource"      = "customer-shared"
          + "resource_type" = "database_user"
        }
      + tags_all       = {
          + "domain"        = "customer"
          + "environment"   = "customer-shared-staging"
          + "resource"      = "customer-shared"
          + "resource_type" = "database_user"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.database_user.aws_ssm_parameter.username will be created
  + resource "aws_ssm_parameter" "username" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "customer-shared-staging-customer-shared-username"
      + tags           = {
          + "domain"        = "customer"
          + "environment"   = "customer-shared-staging"
          + "resource"      = "customer-shared"
          + "resource_type" = "database_user"
        }
      + tags_all       = {
          + "domain"        = "customer"
          + "environment"   = "customer-shared-staging"
          + "resource"      = "customer-shared"
          + "resource_type" = "database_user"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.database_user.cockroach_sql_user.default will be created
  + resource "cockroach_sql_user" "default" {
      + cluster_id = (sensitive value)
      + id         = (known after apply)
      + name       = "customer-shared"
      + password   = (sensitive value)
    }

  # module.database_user.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*